In [193]:
# !pip freeze > requirements.txt

**CAPITULO 1, 2, 3: INTRODUCCION, INSTALACION DE LIBRERIAS Y EJEMPLO BASICO CON PANDAS**

In [194]:
import pandas as pd
import numpy as np
import os

In [195]:
numeros = [1, 2, 3, 4, 5]
serie = pd.Series(numeros)
serie, type(serie)

(0    1
 1    2
 2    3
 3    4
 4    5
 dtype: int64,
 pandas.core.series.Series)

In [196]:
data = {
    "Nombre": [
        "Juan", "Ana", "Pedro", "Luisa", "Carlos", "María", "Javier", "Laura", "David", "Sara",
        "Andrés", "Elena", "Miguel", "Clara", "Rafael", "Sofía", "Hugo", "Paula", "Daniel", "Irene"
    ],
    "Apellido": [
        "Gómez", "Martínez", "López", "Ruiz", "Hernández", "Díaz", "Sánchez", "Ramírez", "Torres", "Flores",
        "Vargas", "Castillo", "Morales", "Romero", "Ortega", "Silva", "Mendoza", "Navarro", "Cortés", "Delgado"
    ],
    "Edad": [
        28, 24, 35, 32, 30, 29, 31, 25, 27, 26,
        22, 34, 33, 21, 36, 23, 38, 20, 37, 19
    ],
    "Ciudad": [
        "Madrid", "Barcelona", "Valencia", "Sevilla", "Bilbao", "Zaragoza", "Málaga", "Murcia", "Palma", "Valladolid",
        "Gijón", "Alicante", "Córdoba", "Vigo", "Donostia", "Granada", "Oviedo", "Tarragona", "A Coruña", "Santander"
    ]
}

In [197]:
df = pd.DataFrame(data)
df.head(5)

   Nombre   Apellido  Edad     Ciudad
0    Juan      Gómez    28     Madrid
1     Ana   Martínez    24  Barcelona
2   Pedro      López    35   Valencia
3   Luisa       Ruiz    32    Sevilla
4  Carlos  Hernández    30     Bilbao

**CAPITULO 4: CREACION E IMPORTACION DE UN DATAFRAME**

In [198]:
#EXPORTANDO A CSV
df.to_csv("data/data.csv", index=False)

In [199]:
#IMPORTANDO CS
df_importado = pd.read_csv("data/data.csv")
# df_importadodo

**CAPITULO 5: FILTRADO Y SELECCION DE DATOS**

In [200]:
nombres = df["Nombre"]
# nombres, type(nombres)

In [201]:
x_cols = ["Nombre", "Edad"]
y_cols = ["Ciudad"]
df_x = df[x_cols]
df_y = df[y_cols]
# df_x
# Filtrando datos

In [202]:
fila = df.loc[0]
fila, type(fila)

(Nombre        Juan
 Apellido     Gómez
 Edad            28
 Ciudad      Madrid
 Name: 0, dtype: object,
 pandas.core.series.Series)

In [203]:
fila_condicional = df[df["Edad"] > 30]
fila_condicional, type(fila_condicional)

(    Nombre  Apellido  Edad    Ciudad
 2    Pedro     López    35  Valencia
 3    Luisa      Ruiz    32   Sevilla
 6   Javier   Sánchez    31    Málaga
 11   Elena  Castillo    34  Alicante
 12  Miguel   Morales    33   Córdoba
 14  Rafael    Ortega    36  Donostia
 16    Hugo   Mendoza    38    Oviedo
 18  Daniel    Cortés    37  A Coruña,
 pandas.core.frame.DataFrame)

In [204]:
filtro = (df["Edad"] > 30) & (df["Ciudad"].str.startswith("S"))
df[filtro], type(df[filtro])

(  Nombre Apellido  Edad   Ciudad
 3  Luisa     Ruiz    32  Sevilla,
 pandas.core.frame.DataFrame)

In [205]:
filtro = (df["Edad"] > 30) & (df["Ciudad"].str.startswith("S"))
resultado = df[filtro]
resultado, type(resultado)

(  Nombre Apellido  Edad   Ciudad
 3  Luisa     Ruiz    32  Sevilla,
 pandas.core.frame.DataFrame)

In [206]:
# Modificando datos
df[df["Nombre"].isin(["Juan", "Ana"])]

  Nombre  Apellido  Edad     Ciudad
0   Juan     Gómez    28     Madrid
1    Ana  Martínez    24  Barcelona

In [207]:
def longitud_nombre(nombre, tam):
    return len(nombre) == tam

df[df["Nombre"].apply(longitud_nombre, tam=3)]

  Nombre  Apellido  Edad     Ciudad
1    Ana  Martínez    24  Barcelona

In [208]:
#filtrar edades entre 20 y 30
filtro = (df["Edad"] >= 20) & (df["Edad"] <= 30)
resultado = df[filtro]
resultado, type(resultado)

(    Nombre   Apellido  Edad      Ciudad
 0     Juan      Gómez    28      Madrid
 1      Ana   Martínez    24   Barcelona
 4   Carlos  Hernández    30      Bilbao
 5    María       Díaz    29    Zaragoza
 7    Laura    Ramírez    25      Murcia
 8    David     Torres    27       Palma
 9     Sara     Flores    26  Valladolid
 10  Andrés     Vargas    22       Gijón
 13   Clara     Romero    21        Vigo
 15   Sofía      Silva    23     Granada
 17   Paula    Navarro    20   Tarragona,
 pandas.core.frame.DataFrame)

In [209]:
# filtrar edades entre 20 y 30 usando el método between
filtro = df["Edad"].between(20, 30)
resultado = df[filtro]
resultado, type(resultado)

(    Nombre   Apellido  Edad      Ciudad
 0     Juan      Gómez    28      Madrid
 1      Ana   Martínez    24   Barcelona
 4   Carlos  Hernández    30      Bilbao
 5    María       Díaz    29    Zaragoza
 7    Laura    Ramírez    25      Murcia
 8    David     Torres    27       Palma
 9     Sara     Flores    26  Valladolid
 10  Andrés     Vargas    22       Gijón
 13   Clara     Romero    21        Vigo
 15   Sofía      Silva    23     Granada
 17   Paula    Navarro    20   Tarragona,
 pandas.core.frame.DataFrame)

**CAPITULO 6: LIMPIEZA, MANIPULACION Y GENERACION DE DATOS EN UN DATAFRAME**

In [210]:
data_to_clean = {
    "Nombre": [
        "Juan", None, "Pedro", None, "Carlos", "María", None, "Laura", "David", "Sara",
        "Andrés", "Elena", "Miguel", None, "Rafael", "Sofía", "Hugo", "Paula", "Daniel", "Irene"
    ],
    "Apellido": [
        "Gómez", "Martínez", "López", "Ruiz", "Hernández", "Díaz", "Sánchez", None, "Torres", "Flores",
        "Vargas", "Castillo", None, "Romero", "Ortega", "Silva", "Mendoza", "Navarro", "Cortés", "Delgado"
    ],
    "Edad": [
        28, 24, 35, np.nan, 30, 29, 31, 25, np.nan, 26,
        22, 34, np.nan, 21, 36, 23, np.nan, 20, 37, np.nan
    ],
    "Ciudad": [
        "Madrid", "Barcelona", "Valencia", None, "Bilbao", "Zaragoza", "Málaga", "Murcia", "Palma", "Valladolid",
        None, "Alicante", "Córdoba", "Vigo", "Donostia", "Granada", "Oviedo", None, "A Coruña", "Santander"
    ]
}

df_to_clean = pd.DataFrame(data_to_clean)
df_to_clean.head(5), type(df_to_clean)

(   Nombre   Apellido  Edad     Ciudad
 0    Juan      Gómez  28.0     Madrid
 1    None   Martínez  24.0  Barcelona
 2   Pedro      López  35.0   Valencia
 3    None       Ruiz   NaN       None
 4  Carlos  Hernández  30.0     Bilbao,
 pandas.core.frame.DataFrame)

In [211]:
# Rellenar valores nulos con un valor específico
df_filled = df_to_clean.fillna(
    {
        "Nombre": "Desconocido",
        "Apellido": "Desconocido",
        "Edad": df_to_clean["Edad"].median(),
        "Ciudad": "Desconocida"
    }
)

df_filled.head(5)

        Nombre   Apellido  Edad       Ciudad
0         Juan      Gómez  28.0       Madrid
1  Desconocido   Martínez  24.0    Barcelona
2        Pedro      López  35.0     Valencia
3  Desconocido       Ruiz  28.0  Desconocida
4       Carlos  Hernández  30.0       Bilbao

In [212]:
#usar el metodo dropna() para eliminar filas con valores nulos
df_dropped = df_to_clean.dropna()
df_dropped.head(5)

   Nombre   Apellido  Edad      Ciudad
0    Juan      Gómez  28.0      Madrid
2   Pedro      López  35.0    Valencia
4  Carlos  Hernández  30.0      Bilbao
5   María       Díaz  29.0    Zaragoza
9    Sara     Flores  26.0  Valladolid

In [213]:
#reemplazar valores especificos de alguna columna
df_replaced = df_to_clean.replace({
    "Ciudad" : {None: "No definida"}
})
df_replaced.head(5)

   Nombre   Apellido  Edad       Ciudad
0    Juan      Gómez  28.0       Madrid
1    None   Martínez  24.0    Barcelona
2   Pedro      López  35.0     Valencia
3    None       Ruiz   NaN  No definida
4  Carlos  Hernández  30.0       Bilbao

In [214]:
#interpolar valores nulos
df_interpolated = df_to_clean.copy()
df_interpolated["Edad"] = df_interpolated["Edad"].interpolate()
df_interpolated.head(5)

   Nombre   Apellido  Edad     Ciudad
0    Juan      Gómez  28.0     Madrid
1    None   Martínez  24.0  Barcelona
2   Pedro      López  35.0   Valencia
3    None       Ruiz  32.5       None
4  Carlos  Hernández  30.0     Bilbao

In [215]:
#valores duplicados
data = {
    "Nombre": [
        "Juan", "Ana", "Pedro", "Juan", "Carlos", "María", "Pedro", "Laura", "David", "Sara",
        "Andrés", "Elena", "Miguel", "Ana", "Rafael", "Sofía", "Hugo", "Paula", "Daniel", "Irene"
    ],
    "Apellido": [
        "Gómez", "Martínez", "López", "Gómez", "Hernández", "Díaz", "López", "Ramírez", "Torres", "Flores",
        "Vargas", "Castillo", "Morales", "Martínez", "Ortega", "Silva", "Mendoza", "Navarro", "Cortés", "Delgado"
    ],
    "Edad": [
        28, 24, 35, 28, 30, 29, 35, 25, 27, 26,
        22, 34, 33, 24, 36, 23, 38, 20, 37, 19
    ],
    "Ciudad": [
        "Madrid", "Barcelona", "Valencia", "Madrid", "Bilbao", "Zaragoza", "Valencia", "Murcia", "Palma", "Valladolid",
        "Gijón", "Alicante", "Córdoba", "Barcelona", "Donostia", "Granada", "Oviedo", "Tarragona", "A Coruña", "Santander"
    ]
}
df_duplicates = pd.DataFrame(data)
df_duplicates.head(5), type(df_duplicates)

(   Nombre   Apellido  Edad     Ciudad
 0    Juan      Gómez    28     Madrid
 1     Ana   Martínez    24  Barcelona
 2   Pedro      López    35   Valencia
 3    Juan      Gómez    28     Madrid
 4  Carlos  Hernández    30     Bilbao,
 pandas.core.frame.DataFrame)

In [216]:
#borra duplicados
df_duplicates_dropped = df_duplicates.drop_duplicates()
df_duplicates_dropped.head(5)

   Nombre   Apellido  Edad     Ciudad
0    Juan      Gómez    28     Madrid
1     Ana   Martínez    24  Barcelona
2   Pedro      López    35   Valencia
4  Carlos  Hernández    30     Bilbao
5   María       Díaz    29   Zaragoza

In [217]:
# renombrar columnas
df_renamed = df_duplicates.rename(
    columns={"Nombre": "Name", "Apellido": "Surname", "Edad": "Age", "Ciudad": "City"}
)
df_renamed.head(5)

     Name    Surname  Age       City
0    Juan      Gómez   28     Madrid
1     Ana   Martínez   24  Barcelona
2   Pedro      López   35   Valencia
3    Juan      Gómez   28     Madrid
4  Carlos  Hernández   30     Bilbao

In [218]:
#ordenar columnas
df_sorted = df_duplicates.sort_values(by=["Edad", "Nombre"], ascending=[True, False])
df_sorted.head(5)

    Nombre  Apellido  Edad     Ciudad
19   Irene   Delgado    19  Santander
17   Paula   Navarro    20  Tarragona
10  Andrés    Vargas    22      Gijón
15   Sofía     Silva    23    Granada
1      Ana  Martínez    24  Barcelona

In [219]:
#OTRA FORMA DE ORDENAR
sorted_columns = [ "Apellido", "Nombre", "Edad", "Ciudad"]
df_sorted_columns = df_duplicates[sorted_columns]
# df_sorted_columns = df_sorted_columns.sort_values(by=["Edad", "Nombre"], ascending=[True, False])
df_sorted_columns.head(5)

    Apellido  Nombre  Edad     Ciudad
0      Gómez    Juan    28     Madrid
1   Martínez     Ana    24  Barcelona
2      López   Pedro    35   Valencia
3      Gómez    Juan    28     Madrid
4  Hernández  Carlos    30     Bilbao

In [220]:
#transformacion de datos
def potencia_cuadrado(x):
    return x ** 2

df["Edad_al_cuadrado"] = df["Edad"].apply(potencia_cuadrado)
# df["Edad_al_cuadrado"] = df["Edad"].apply(lambda x: x ** 2)
df.head(5)

   Nombre   Apellido  Edad     Ciudad  Edad_al_cuadrado
0    Juan      Gómez    28     Madrid               784
1     Ana   Martínez    24  Barcelona               576
2   Pedro      López    35   Valencia              1225
3   Luisa       Ruiz    32    Sevilla              1024
4  Carlos  Hernández    30     Bilbao               900

**CAPITULO 7: AÑADIR Y AGRUPAR DATOS CON PANDAS**

In [221]:
data_payment = {
    "Nombre": [
        "Juan", "Ana", "Pedro", "Luisa", "Carlos", "María", "Javier", "Laura", "David", "Sara",
        "Andrés", "Elena", "Miguel", "Clara", "Rafael", "Sofía", "Hugo", "Paula", "Daniel", "Irene"
    ],
    "Apellido": [
        "Gómez", "Martínez", "López", "Ruiz", "Hernández", "Díaz", "Sánchez", "Ramírez", "Torres", "Flores",
        "Vargas", "Castillo", "Morales", "Romero", "Ortega", "Silva", "Mendoza", "Navarro", "Cortés", "Delgado"
    ],
    "Edad": [
        28, 24, 35, 32, 30, 29, 31, 25, 27, 26,
        22, 34, 33, 21, 36, 23, 38, 20, 37, 19
    ],
    "Ciudad": [
        "Madrid", "Barcelona", "Valencia", "Sevilla", "Bilbao", "Zaragoza", "Málaga", "Murcia", "Palma", "Valladolid",
        "Gijón", "Alicante", "Córdoba", "Vigo", "Donostia", "Granada", "Oviedo", "Tarragona", "A Coruña", "Santander"
    ],
    "Salario": [
        30000, 32000, 35000, 28000, 40000, 31000, 33000, 29000, 37000, 36000,
        34000, 38000, 39000, 27000, 41000, 42000, 43000, 44000, 45000, 46000
    ],
    "Horas_trabajadas": [
        40, 38, 42, 36, 45, 39, 41, 37, 44, 43,
        35, 46, 47, 34, 48, 49, 50, 33, 51, 32
    ],
}
df_payment = pd.DataFrame(data_payment)
df_payment.head(5)

   Nombre   Apellido  Edad     Ciudad  Salario  Horas_trabajadas
0    Juan      Gómez    28     Madrid    30000                40
1     Ana   Martínez    24  Barcelona    32000                38
2   Pedro      López    35   Valencia    35000                42
3   Luisa       Ruiz    32    Sevilla    28000                36
4  Carlos  Hernández    30     Bilbao    40000                45

In [222]:
#agrupar datos por ciudad
group = df_payment.groupby("Ciudad")
group.groups

{'A Coruña': [18], 'Alicante': [11], 'Barcelona': [1], 'Bilbao': [4], 'Córdoba': [12], 'Donostia': [14], 'Gijón': [10], 'Granada': [15], 'Madrid': [0], 'Murcia': [7], 'Málaga': [6], 'Oviedo': [16], 'Palma': [8], 'Santander': [19], 'Sevilla': [3], 'Tarragona': [17], 'Valencia': [2], 'Valladolid': [9], 'Vigo': [13], 'Zaragoza': [5]}

In [223]:
df_payment_grouped_by_edad = df_payment.groupby("Edad")[["Salario", "Horas_trabajadas"]].agg(["mean", "sum", "count"])
df_payment_grouped_by_edad.head(5)

      Salario              Horas_trabajadas
         mean    sum count             mean sum count
Edad
19    46000.0  46000     1             32.0  32     1
20    44000.0  44000     1             33.0  33     1
21    27000.0  27000     1             34.0  34     1
22    34000.0  34000     1             35.0  35     1
23    42000.0  42000     1             49.0  49     1

In [224]:
df_payment_grouped_by_nombre_apellido = df_payment.groupby(["Nombre", "Apellido"])["Horas_trabajadas"].sum()
df_payment_grouped_by_nombre_apellido.head(5)

Nombre  Apellido
Ana     Martínez     38
Andrés  Vargas       35
Carlos  Hernández    45
Clara   Romero       34
Daniel  Cortés       51
Name: Horas_trabajadas, dtype: int64

In [225]:
df_payment_grouped_by_ciudad_salario = df_payment.groupby("Ciudad")["Salario"].mean()
df_payment_grouped_by_ciudad_salario.head(5)

Ciudad
A Coruña     45000.0
Alicante     38000.0
Barcelona    32000.0
Bilbao       40000.0
Córdoba      39000.0
Name: Salario, dtype: float64

**CAPITULO 8: AGREGACION DE DATOS**

In [178]:
group = df_payment.groupby("Nombre")

aggregated_data = group.agg({
    "Horas_trabajadas": "sum",
    "Salario": "sum"
})

aggregated_data.head(5)

#o tambien
# aggregated_data = df_payment.groupby("Nombre")[["Horas_trabajadas", "Salario"]].sum()
# aggregated_data.head(5)

        Horas_trabajadas  Salario
Nombre
Ana                   38    32000
Andrés                35    34000
Carlos                45    40000
Clara                 34    27000
Daniel                51    45000

In [179]:
#definir una funcion de agracion personalizada
def custom_aggregation(x):
    # return x.max() - x.min()
    # return x.mean() - x.std()
    # return x.mean() + x.std()
    return x.max() + x.min()

#aplicar la funcion de agregacion personalizada
grouped_custom = group.agg({
    "Horas_trabajadas": custom_aggregation,
    "Salario": custom_aggregation
})

grouped_custom.head(5)

        Horas_trabajadas  Salario
Nombre
Ana                   76    64000
Andrés                70    68000
Carlos                90    80000
Clara                 68    54000
Daniel               102    90000

**CAPITULO 9: AGREGACION Y AGRUPACION MULTINIVEL**

In [180]:
data_payment["Price_category"] = pd.cut(
    data_payment["Salario"],
    bins=[0, 30000, 40000, np.inf],
    labels=["Bajo", "Medio", "Alto"]
)
df_cat = pd.DataFrame(data_payment)
df_cat = df_cat.dropna(subset=["Price_category"])
df_cat.head(5)

,Nombre,Apellido,Edad,Ciudad,Salario,Horas_trabajadas,Price_category
0,Juan,Gómez,28,Madrid,30000,40,Bajo
1,Ana,Martínez,24,Barcelona,32000,38,Medio
2,Pedro,López,35,Valencia,35000,42,Medio
3,Luisa,Ruiz,32,Sevilla,28000,36,Bajo
4,Carlos,Hernández,30,Bilbao,40000,45,Medio

In [181]:
#agrupar datos por salario y horas trabajadas
multi_group = df_cat.groupby(["Price_category", "Horas_trabajadas"], observed=True)
multi_group.groups

{('Alto', 32): [19], ('Alto', 33): [17], ('Alto', 48): [14], ('Alto', 49): [15], ('Alto', 50): [16], ('Alto', 51): [18], ('Bajo', 34): [13], ('Bajo', 36): [3], ('Bajo', 37): [7], ('Bajo', 40): [0], ('Medio', 35): [10], ('Medio', 38): [1], ('Medio', 39): [5], ('Medio', 41): [6], ('Medio', 42): [2], ('Medio', 43): [9], ('Medio', 44): [8], ('Medio', 45): [4], ('Medio', 46): [11], ('Medio', 47): [12]}

In [182]:
#calcular la media de edad, salario y horas trabajadas por categoria y edad
agg_data_multi = multi_group.agg({
    "Edad": "mean",
    "Salario": "mean",
    "Horas_trabajadas": "mean"
})

agg_data_multi.head(5)

                                 Edad  Salario  Horas_trabajadas
Price_category Horas_trabajadas
Bajo           34                21.0  27000.0              34.0
               36                32.0  28000.0              36.0
               37                25.0  29000.0              37.0
               40                28.0  30000.0              40.0
Medio          35                22.0  34000.0              35.0

**CAPITULO 10: AÑADIR NUEVOS DATOS A UN DATAFRAME CON PANDAS**

In [183]:
#AGREGAR UNA NUEVA COLUMNA
df_payment["Salario_anual"] = df_payment["Salario"] * 12
df_payment.head(5)

,Nombre,Apellido,Edad,Ciudad,Salario,Horas_trabajadas,Salario_anual
0,Juan,Gómez,28,Madrid,30000,40,360000
1,Ana,Martínez,24,Barcelona,32000,38,384000
2,Pedro,López,35,Valencia,35000,42,420000
3,Luisa,Ruiz,32,Sevilla,28000,36,336000
4,Carlos,Hernández,30,Bilbao,40000,45,480000

In [184]:
#AÑADIR UNA NUEVA FILA
new_row = pd.Series({
    "Nombre": "Mario",
    "Apellido": "Hernández",
    "Edad": 30,
    "Ciudad": "Valencia",
    "Salario": 50000,
    "Horas_trabajadas": 43
})

df_payment = pd.concat([df_payment, new_row.to_frame().T], ignore_index=True)
df_payment["Salario_anual"] = df_payment["Salario"] * 12
df_payment

    Nombre   Apellido Edad      Ciudad Salario Horas_trabajadas Salario_anual
0     Juan      Gómez   28      Madrid   30000               40        360000
1      Ana   Martínez   24   Barcelona   32000               38        384000
2    Pedro      López   35    Valencia   35000               42        420000
3    Luisa       Ruiz   32     Sevilla   28000               36        336000
4   Carlos  Hernández   30      Bilbao   40000               45        480000
5    María       Díaz   29    Zaragoza   31000               39        372000
6   Javier    Sánchez   31      Málaga   33000               41        396000
7    Laura    Ramírez   25      Murcia   29000               37        348000
8    David     Torres   27       Palma   37000               44        444000
9     Sara     Flores   26  Valladolid   36000               43        432000
10  Andrés     Vargas   22       Gijón   34000               35        408000
11   Elena   Castillo   34    Alicante   38000               46        456000
12  Miguel    Morales   33     Córdoba   39000               47        468000
13   Clara     Romero   21        Vigo   27000               34        324000
14  Rafael     Ortega   36    Donostia   41000               48        492000
15   Sofía      Silva   23     Granada   42000               49        504000
16    Hugo    Mendoza   38      Oviedo   43000               50        516000
17   Paula    Navarro   20   Tarragona   44000               33        528000
18  Daniel     Cortés   37    A Coruña   45000               51        540000
19   Irene    Delgado   19   Santander   46000               32        552000
20   Mario  Hernández   30    Valencia   50000               43        600000

**CAPITULO 11: COMBINACION DE DATAFRAMES**

In [185]:
data_departure = {
    "Nombre": [
        "Juan", "Ana", "Pedro", "Luisa", "Carlos",
        "María", "Javier", "Laura", "David", "Sara"
    ],
    "Departamento": [
        "Ventas", "Recursos Humanos", "Marketing", "Finanzas", "IT",
        "Contabilidad", "Operaciones", "Legal", "Logística", "Compras"
    ],
    "Turno": [
        "Mañana", "Tarde", "Mañana", "Noche", "Mañana",
        "Tarde", "Noche", "Mañana", "Tarde", "Noche"
    ]
}
df_departure = pd.DataFrame(data_departure)
df_departure.head(5)

   Nombre      Departamento   Turno
0    Juan            Ventas  Mañana
1     Ana  Recursos Humanos   Tarde
2   Pedro         Marketing  Mañana
3   Luisa          Finanzas   Noche
4  Carlos                IT  Mañana

In [186]:
data_employees = {
    "Nombre": ["Tomás", "Eva", "Noelia", "Mariano", "Lucía"],
    "Apellido": ["Pérez", "Alonso", "Fuentes", "Ibáñez", "Santos"],
    "Edad": [27, 29, 26, 28, 30],
    "Ciudad": ["Madrid", "Granada", "Murcia", "Barcelona", "Sevilla"],
    "Salario": [34000, 37000, 36000, 35000, 39000],
    "Horas_trabajadas": [40, 42, 38, 39, 41]
}
df_nuevos_empleados = pd.DataFrame(data_employees)
df_nuevos_empleados["Salario_anual"] = df_nuevos_empleados["Salario"] * 12
df_nuevos_empleados.head(5)

    Nombre Apellido  Edad     Ciudad  Salario  Horas_trabajadas  Salario_anual
0    Tomás    Pérez    27     Madrid    34000                40         408000
1      Eva   Alonso    29    Granada    37000                42         444000
2   Noelia  Fuentes    26     Murcia    36000                38         432000
3  Mariano   Ibáñez    28  Barcelona    35000                39         420000
4    Lucía   Santos    30    Sevilla    39000                41         468000

In [187]:
#COMBINACION DE DATAFRAMES POR FILAS
data_payment_updated = pd.concat([df_payment, df_nuevos_empleados], ignore_index=True)
data_payment_updated

     Nombre   Apellido Edad      Ciudad Salario Horas_trabajadas Salario_anual
0      Juan      Gómez   28      Madrid   30000               40        360000
1       Ana   Martínez   24   Barcelona   32000               38        384000
2     Pedro      López   35    Valencia   35000               42        420000
3     Luisa       Ruiz   32     Sevilla   28000               36        336000
4    Carlos  Hernández   30      Bilbao   40000               45        480000
5     María       Díaz   29    Zaragoza   31000               39        372000
6    Javier    Sánchez   31      Málaga   33000               41        396000
7     Laura    Ramírez   25      Murcia   29000               37        348000
8     David     Torres   27       Palma   37000               44        444000
9      Sara     Flores   26  Valladolid   36000               43        432000
10   Andrés     Vargas   22       Gijón   34000               35        408000
11    Elena   Castillo   34    Alicante   38000               46        456000
12   Miguel    Morales   33     Córdoba   39000               47        468000
13    Clara     Romero   21        Vigo   27000               34        324000
14   Rafael     Ortega   36    Donostia   41000               48        492000
15    Sofía      Silva   23     Granada   42000               49        504000
16     Hugo    Mendoza   38      Oviedo   43000               50        516000
17    Paula    Navarro   20   Tarragona   44000               33        528000
18   Daniel     Cortés   37    A Coruña   45000               51        540000
19    Irene    Delgado   19   Santander   46000               32        552000
20    Mario  Hernández   30    Valencia   50000               43        600000
21    Tomás      Pérez   27      Madrid   34000               40        408000
22      Eva     Alonso   29     Granada   37000               42        444000
23   Noelia    Fuentes   26      Murcia   36000               38        432000
24  Mariano     Ibáñez   28   Barcelona   35000               39        420000
25    Lucía     Santos   30     Sevilla   39000               41        468000

In [188]:
#COMBINACION DE DATAFRAMES POR COLUMNAS
payroll = pd.concat([data_payment_updated, df_departure], axis=1)
payroll

,Nombre,Apellido,Edad,Ciudad,Salario,Horas_trabajadas,Salario_anual,Nombre,Departamento,Turno
0,Juan,Gómez,28,Madrid,30000,40,360000,Juan,Ventas,Mañana
1,Ana,Martínez,24,Barcelona,32000,38,384000,Ana,Recursos Humanos,Tarde
2,Pedro,López,35,Valencia,35000,42,420000,Pedro,Marketing,Mañana
3,Luisa,Ruiz,32,Sevilla,28000,36,336000,Luisa,Finanzas,Noche
4,Carlos,Hernández,30,Bilbao,40000,45,480000,Carlos,IT,Mañana
5,María,Díaz,29,Zaragoza,31000,39,372000,María,Contabilidad,Tarde
6,Javier,Sánchez,31,Málaga,33000,41,396000,Javier,Operaciones,Noche
7,Laura,Ramírez,25,Murcia,29000,37,348000,Laura,Legal,Mañana
8,David,Torres,27,Palma,37000,44,444000,David,Logística,Tarde
9,Sara,Flores,26,Valladolid,36000,43,432000,Sara,Compras,Noche
10,Andrés,Vargas,22,Gijón,34000,35,408000,NaN,NaN,NaN
11,Elena,Castillo,34,Alicante,38000,46,456000,NaN,NaN,NaN
12,Miguel,Morales,33,Córdoba,39000,47,468000,NaN,NaN,NaN
13,Clara,Romero,21,Vigo,27000,34,324000,NaN,NaN,NaN
14,Rafael,Ortega,36,Donostia,41000,48,492000,NaN,NaN,NaN
15,Sofía,Silva,23,Granada,42000,49,504000,NaN,NaN,NaN
16,Hugo,Mendoza,38,Oviedo,43000,50,516000,NaN,NaN,NaN
17,Paula,Navarro,20,Tarragona,44000,33,528000,NaN,NaN,NaN
18,Daniel,Cortés,37,A Coruña,45000,51,540000,NaN,NaN,NaN
19,Irene,Delgado,19,Santander,46000,32,552000,NaN,NaN,NaN
20,Mario,Hernández,30,Valencia,50000,43,600000,NaN,NaN,NaN
21,Tomás,Pérez,27,Madrid,34000,40,408000,NaN,NaN,NaN
22,Eva,Alonso,29,Granada,37000,42,444000,NaN,NaN,NaN
23,Noelia,Fuentes,26,Murcia,36000,38,432000,NaN,NaN,NaN
24,Mariano,Ibáñez,28,Barcelona,35000,39,420000,NaN,NaN,NaN
25,Lucía,Santos,30,Sevilla,39000,41,468000,NaN,NaN,NaN

In [189]:
# COMBINACION DE DATAFRAMES POR FILAS CON JOIN
payroll_join = pd.merge(
    data_payment_updated,
    df_departure,
    on="Nombre",
    how="inner"
)
payroll

,Nombre,Apellido,Edad,Ciudad,Salario,Horas_trabajadas,Salario_anual,Nombre,Departamento,Turno
0,Juan,Gómez,28,Madrid,30000,40,360000,Juan,Ventas,Mañana
1,Ana,Martínez,24,Barcelona,32000,38,384000,Ana,Recursos Humanos,Tarde
2,Pedro,López,35,Valencia,35000,42,420000,Pedro,Marketing,Mañana
3,Luisa,Ruiz,32,Sevilla,28000,36,336000,Luisa,Finanzas,Noche
4,Carlos,Hernández,30,Bilbao,40000,45,480000,Carlos,IT,Mañana
5,María,Díaz,29,Zaragoza,31000,39,372000,María,Contabilidad,Tarde
6,Javier,Sánchez,31,Málaga,33000,41,396000,Javier,Operaciones,Noche
7,Laura,Ramírez,25,Murcia,29000,37,348000,Laura,Legal,Mañana
8,David,Torres,27,Palma,37000,44,444000,David,Logística,Tarde
9,Sara,Flores,26,Valladolid,36000,43,432000,Sara,Compras,Noche
10,Andrés,Vargas,22,Gijón,34000,35,408000,NaN,NaN,NaN
11,Elena,Castillo,34,Alicante,38000,46,456000,NaN,NaN,NaN
12,Miguel,Morales,33,Córdoba,39000,47,468000,NaN,NaN,NaN
13,Clara,Romero,21,Vigo,27000,34,324000,NaN,NaN,NaN
14,Rafael,Ortega,36,Donostia,41000,48,492000,NaN,NaN,NaN
15,Sofía,Silva,23,Granada,42000,49,504000,NaN,NaN,NaN
16,Hugo,Mendoza,38,Oviedo,43000,50,516000,NaN,NaN,NaN
17,Paula,Navarro,20,Tarragona,44000,33,528000,NaN,NaN,NaN
18,Daniel,Cortés,37,A Coruña,45000,51,540000,NaN,NaN,NaN
19,Irene,Delgado,19,Santander,46000,32,552000,NaN,NaN,NaN
20,Mario,Hernández,30,Valencia,50000,43,600000,NaN,NaN,NaN
21,Tomás,Pérez,27,Madrid,34000,40,408000,NaN,NaN,NaN
22,Eva,Alonso,29,Granada,37000,42,444000,NaN,NaN,NaN
23,Noelia,Fuentes,26,Murcia,36000,38,432000,NaN,NaN,NaN
24,Mariano,Ibáñez,28,Barcelona,35000,39,420000,NaN,NaN,NaN
25,Lucía,Santos,30,Sevilla,39000,41,468000,NaN,NaN,NaN

In [190]:
payroll_join = pd.merge(
    data_payment_updated,
    df_departure,
    on="Nombre",
    how="outer"
)

# Verifica y elimina columnas duplicadas si es necesario
payroll_join = payroll_join.loc[:, ~payroll_join.columns.duplicated()]
payroll_join

,Nombre,Apellido,Edad,Ciudad,Salario,Horas_trabajadas,Salario_anual,Departamento,Turno
0,Ana,Martínez,24,Barcelona,32000,38,384000,Recursos Humanos,Tarde
1,Andrés,Vargas,22,Gijón,34000,35,408000,NaN,NaN
2,Carlos,Hernández,30,Bilbao,40000,45,480000,IT,Mañana
3,Clara,Romero,21,Vigo,27000,34,324000,NaN,NaN
4,Daniel,Cortés,37,A Coruña,45000,51,540000,NaN,NaN
5,David,Torres,27,Palma,37000,44,444000,Logística,Tarde
6,Elena,Castillo,34,Alicante,38000,46,456000,NaN,NaN
7,Eva,Alonso,29,Granada,37000,42,444000,NaN,NaN
8,Hugo,Mendoza,38,Oviedo,43000,50,516000,NaN,NaN
9,Irene,Delgado,19,Santander,46000,32,552000,NaN,NaN
10,Javier,Sánchez,31,Málaga,33000,41,396000,Operaciones,Noche
11,Juan,Gómez,28,Madrid,30000,40,360000,Ventas,Mañana
12,Laura,Ramírez,25,Murcia,29000,37,348000,Legal,Mañana
13,Lucía,Santos,30,Sevilla,39000,41,468000,NaN,NaN
14,Luisa,Ruiz,32,Sevilla,28000,36,336000,Finanzas,Noche
15,Mariano,Ibáñez,28,Barcelona,35000,39,420000,NaN,NaN
16,Mario,Hernández,30,Valencia,50000,43,600000,NaN,NaN
17,María,Díaz,29,Zaragoza,31000,39,372000,Contabilidad,Tarde
18,Miguel,Morales,33,Córdoba,39000,47,468000,NaN,NaN
19,Noelia,Fuentes,26,Murcia,36000,38,432000,NaN,NaN
20,Paula,Navarro,20,Tarragona,44000,33,528000,NaN,NaN
21,Pedro,López,35,Valencia,35000,42,420000,Marketing,Mañana
22,Rafael,Ortega,36,Donostia,41000,48,492000,NaN,NaN
23,Sara,Flores,26,Valladolid,36000,43,432000,Compras,Noche
24,Sofía,Silva,23,Granada,42000,49,504000,NaN,NaN
25,Tomás,Pérez,27,Madrid,34000,40,408000,NaN,NaN

In [191]:
availiable_departments = df_departure['Departamento'].dropna().unique()
availiable_shifts = df_departure['Turno'].dropna().unique()

payroll_join['Departamento'] = payroll_join['Departamento'].apply(
    lambda x: np.random.choice(availiable_departments) if pd.isna(x) else x
)

payroll_join['Turno'] = payroll_join['Turno'].apply(
    lambda x: np.random.choice(availiable_shifts) if pd.isna(x) else x
)

os.makedirs("out", exist_ok=True)

payroll_join
payroll_join.to_csv("out/registro_de_pago.csv", index=False)
payroll_join.to_excel("out/registro_de_pago.xlsx", index=False)